devdnl/dnx-rtos/src/system/drivers/dma/stm32f1/dma.c
        return err;
}

//==============================================================================
/**
 * @brief Release device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_RELEASE(DMA, void *device_handle)
{
        UNUSED_ARG1(device_handle);
        return EPERM;
}

//==============================================================================
/**
 * @brief Open device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_OPEN(DMA, void *device_handle, u32_t flags)
{
        UNUSED_ARG2(device_handle, flags);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Close device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_CLOSE(DMA, void *device_handle, bool force)
{
        UNUSED_ARG2(device_handle, force);
        return ESUCC;
}

//==============================================================================
/**
 * @brief Write data to device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_WRITE(DMA,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG6(device_handle, src, count, fpos, wrcnt, fattr);

        return EPERM;
}

//==============================================================================
/**
 * @brief Read data from device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_READ(DMA,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG6(device_handle, dst, count, fpos, rdcnt, fattr);

        return EPERM;
}

//==============================================================================
/**
 * @brief IO control.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_IOCTL(DMA, void *device_handle, int request, void *arg)
{
        DMA_RT_t *hdl = device_handle;

        int err = EPERM;

        /*
         * Note:
         * Only the DMA2 controller is able to perform memory-to-memory transfers.
         * It is peripheral limitation.
         */
        if (hdl->major == 1 && arg) {
                switch (request) {
                case IOCTL_DMA__TRANSFER: {
                        err = EBUSY;

                        u32_t dmad    = 0;
                        u8_t  channel = 0;

                        for (; channel < DMA_HW[hdl->major].chcnt; channel++) {
                                dmad = _DMA_DDI_reserve(1, channel);
                                if (dmad) break;
                        }

                        if (dmad && (hdl->queue[channel] == NULL)) {
                                err = sys_queue_create(1, sizeof(int), &hdl->queue[channel]);
                                if (err) {
                                        _DMA_DDI_release(dmad);
                                        dmad = 0;
                                }
                        }

                        if (dmad) {
                                const DMA_transfer_t *transfer = arg;

                                u32_t PMSIZE;
                                u32_t NDT;

                                if (  ((transfer->size & 3) == 0)
                                   && ((cast(u32_t, transfer->src) & 3) == 0)
                                   && ((cast(u32_t, transfer->dst) & 3) == 0) ) {

                                        PMSIZE = (2 << 10) | (2 << 8);

                                        NDT = transfer->size / 4;

                                } else if (  ((transfer->size & 1) == 0)
                                          && ((cast(u32_t, transfer->src) & 1) == 0)
                                          && ((cast(u32_t, transfer->dst) & 1) == 0) ) {

                                        PMSIZE = (1 << 10) | (1 << 8);

                                        NDT = transfer->size / 2;

                                } else {
                                        PMSIZE = 0;
                                        NDT   = transfer->size;
                                }

                                _DMA_DDI_config_t config;
                                config.arg      = hdl->queue[channel];
                                config.callback = M2M_callback;
                                config.release  = true;
                                config.PA       = cast(u32_t, transfer->src);
                                config.MA       = cast(u32_t, transfer->dst);
                                config.NDT      = NDT;
                                config.CR       = PMSIZE | DMA_CCR1_MEM2MEM
                                                 | DMA_CCR1_MINC | DMA_CCR1_PINC;

                                err = _DMA_DDI_transfer(dmad, &config);
                                if (!err) {
                                        int ferr = EIO;
                                        err = sys_queue_receive(hdl->queue[channel],
                                                                &ferr,
                                                                M2M_TRANSFER_TIMEOUT);

                                        if (!err) {
                                                err = ferr;
                                        }
                                }
                        }
                        break;
                }

                default:
                        err = EBADRQC;
                        break;
                }
        }

